
tap "mdogan/zulu"

brew "bash-completion"
brew "direnv"
brew "dive"
brew "git"
brew "git-lfs"
brew "k9s"
brew "gnu-sed"
brew "gnupg"
brew "gpg2"
brew "helm"
brew "helmfile"
brew "htop"
brew "jenv"
brew "jq"
brew "maven"
brew "nvm"
brew "openshift-cli"
brew "openssl"
# gpg
brew "pinentry-mac"
brew "ripgrep"
brew "spaceship"
brew "yq"
brew "zsh-completions"

cask "docker"
cask "firefox"
cask "intellij-idea"
cask "iterm2"
cask "libreoffice"
cask "slack"

cask "mdogan/zulu/zulu-jdk8"
cask "mdogan/zulu/zulu-jdk11"
cask "mdogan/zulu/zulu-jdk17"

# nuxeo third parties runtime
brew "ccextractor"
brew "exiftool"
brew "ffmpeg"
brew "ghostscript"
brew "imagemagick"
brew "libwpd"
brew "poppler"
brew "ufraw"

